cmsis-svd/cmsis-svd/data/Infineon/s6e2ghxj.svd
        <!-- REGISTER "BUR07" -->
        <register>
          <name>BUR07</name>
          <description>Backup Registers from 7</description>
          <addressOffset>0x806</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR08" -->
        <register>
          <name>BUR08</name>
          <description>Backup Registers from 8</description>
          <addressOffset>0x807</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR09" -->
        <register>
          <name>BUR09</name>
          <description>Backup Registers from 9</description>
          <addressOffset>0x808</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR10" -->
        <register>
          <name>BUR10</name>
          <description>Backup Registers from 10</description>
          <addressOffset>0x809</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR11" -->
        <register>
          <name>BUR11</name>
          <description>Backup Registers from 11</description>
          <addressOffset>0x80A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR12" -->
        <register>
          <name>BUR12</name>
          <description>Backup Registers from 12</description>
          <addressOffset>0x80B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR13" -->
        <register>
          <name>BUR13</name>
          <description>Backup Registers from 13</description>
          <addressOffset>0x80C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR14" -->
        <register>
          <name>BUR14</name>
          <description>Backup Registers from 14</description>
          <addressOffset>0x80D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR15" -->
        <register>
          <name>BUR15</name>
          <description>Backup Registers from 15</description>
          <addressOffset>0x80E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR16" -->
        <register>
          <name>BUR16</name>
          <description>Backup Registers from 16</description>
          <addressOffset>0x80F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "USBCLK" -->
    <peripheral>
      <name>USBCLK</name>
      <description>USB Clock</description>
      <version>A</version>
      <groupName>USBCLK</groupName>
      <baseAddress>0x40036000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UCCR" -->
        <register>
          <name>UCCR</name>
          <description>USB Clock Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0B</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UCEN1" -->
            <field>
              <name>UCEN1</name>
              <description>USB1 clock output enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCSEL" -->
            <field>
              <name>UCSEL</name>
              <description>USB clock selection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCEN0" -->
            <field>
              <name>UCEN0</name>
              <description>USB0 clock output enable bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR1" -->
        <register>
          <name>UPCR1</name>
          <description>USB-PLL Control Register 1</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPINC" -->
            <field>
              <name>UPINC</name>
              <description>USB-PLL input clock selection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UPLLEN" -->
            <field>
              <name>UPLLEN</name>
              <description>USB-PLL oscillation enable bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
