cmsis-svd/cmsis-svd/data/Infineon/s6e2ghxj.svd
        <!-- REGISTER "WTTR" -->
        <register>
          <name>WTTR</name>
          <description>Timer Setting Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM" -->
            <field>
              <name>TM</name>
              <description>Timer setting register</description>
              <msb>17</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCLKS" -->
        <register>
          <name>WTCLKS</name>
          <description>Clock Selection Register</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCLKS" -->
            <field>
              <name>WTCLKS</name>
              <description>Input clock selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCLKM" -->
        <register>
          <name>WTCLKM</name>
          <description>Selection Clock Status Register</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCLKM" -->
            <field>
              <name>WTCLKM</name>
              <description>Clock selection status bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCAL" -->
        <register>
          <name>WTCAL</name>
          <description>Frequency Correction Value Setting Register</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x03FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCAL" -->
            <field>
              <name>WTCAL</name>
              <description>Frequency correction value setting bits</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCALEN" -->
        <register>
          <name>WTCALEN</name>
          <description>Frequency Correction Enable Register</description>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCALEN" -->
            <field>
              <name>WTCALEN</name>
              <description>Frequency correction enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDIV" -->
        <register>
          <name>WTDIV</name>
          <description>Divider Ratio Setting Register</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTDIV" -->
            <field>
              <name>WTDIV</name>
              <description>Divider ratio setting bits</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDIVEN" -->
        <register>
          <name>WTDIVEN</name>
          <description>Divider Output Enable Register</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTDIVRDY" -->
            <field>
              <name>WTDIVRDY</name>
              <description>Divider status bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WTDIVEN" -->
            <field>
              <name>WTDIVEN</name>
              <description>Divider enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LSCRP" -->
    <peripheral>
      <name>LSCRP</name>
      <description>Low-speed CR Prescaler</description>
      <version>A</version>
      <groupName>LSCRP</groupName>
      <baseAddress>0x4003C000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LCR_PRSLD" -->
        <register>
          <name>LCR_PRSLD</name>
          <description>Low-speed CR Prescaler Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCR_PRSLD" -->
            <field>
              <name>LCR_PRSLD</name>
              <description>Low-speed CR Prescaler Load</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
