cmsis-svd/cmsis-svd/data/Infineon/s6e2ghxj.svd
        <!-- REGISTER "EP2C" -->
        <register>
          <name>EP2C</name>
          <description>EP2 Control Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6040</resetValue>
          <resetMask>0xFE7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EPEN" -->
            <field>
              <name>EPEN</name>
              <description>Endpoint Enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TYPE" -->
            <field>
              <name>TYPE</name>
              <description>Endpoint Transfer Type Select bits</description>
              <msb>14</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description>Endpoint Transfer Direction Select bit </description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAE" -->
            <field>
              <name>DMAE</name>
              <description>DMA Automatic Transfer Enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NULE" -->
            <field>
              <name>NULE</name>
              <description>Null Automatic Transfer Enable bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description>Endpoint Stall Setting bit </description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS2" -->
            <field>
              <name>PKS2</name>
              <description>Packet Size Setting bits</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP3C" -->
        <register>
          <name>EP3C</name>
          <description>EP3 Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6040</resetValue>
          <resetMask>0xFE7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EPEN" -->
            <field>
              <name>EPEN</name>
              <description>Endpoint Enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TYPE" -->
            <field>
              <name>TYPE</name>
              <description>Endpoint Transfer Type Select bits</description>
              <msb>14</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description>Endpoint Transfer Direction Select bit </description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAE" -->
            <field>
              <name>DMAE</name>
              <description>DMA Automatic Transfer Enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NULE" -->
            <field>
              <name>NULE</name>
              <description>Null Automatic Transfer Enable bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description>Endpoint Stall Setting bit </description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS3" -->
            <field>
              <name>PKS3</name>
              <description>Packet Size Setting bits</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP4C" -->
        <register>
          <name>EP4C</name>
          <description>EP4 Control Register</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6040</resetValue>
          <resetMask>0xFE7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EPEN" -->
            <field>
              <name>EPEN</name>
              <description>Endpoint Enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TYPE" -->
            <field>
              <name>TYPE</name>
              <description>Endpoint Transfer Type Select bits</description>
              <msb>14</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description>Endpoint Transfer Direction Select bit </description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAE" -->
            <field>
              <name>DMAE</name>
              <description>DMA Automatic Transfer Enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NULE" -->
            <field>
              <name>NULE</name>
              <description>Null Automatic Transfer Enable bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description>Endpoint Stall Setting bit </description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS4" -->
            <field>
              <name>PKS4</name>
              <description>Packet Size Setting bits</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP5C" -->
        <register>
          <name>EP5C</name>
          <description>EP5 Control Register</description>
          <addressOffset>0x38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6040</resetValue>
          <resetMask>0xFE7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EPEN" -->
            <field>
              <name>EPEN</name>
              <description>Endpoint Enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TYPE" -->
            <field>
              <name>TYPE</name>
              <description>Endpoint Transfer Type Select bits</description>
              <msb>14</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description>Endpoint Transfer Direction Select bit </description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAE" -->
            <field>
              <name>DMAE</name>
              <description>DMA Automatic Transfer Enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NULE" -->
            <field>
              <name>NULE</name>
              <description>Null Automatic Transfer Enable bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description>Endpoint Stall Setting bit </description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS5" -->
            <field>
              <name>PKS5</name>
              <description>Packet Size Setting bits</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
