cmsis-svd/cmsis-svd/data/Infineon/s6e2ghxj.svd
        <!-- REGISTER "EPFR15" -->
        <register>
          <name>EPFR15</name>
          <description>Extended Pin Function Setting Register 15</description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EINT31S" -->
            <field>
              <name>EINT31S</name>
              <description>External Interrupt 31 Input Select bits</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT30S" -->
            <field>
              <name>EINT30S</name>
              <description>External Interrupt 30 Input Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT29S" -->
            <field>
              <name>EINT29S</name>
              <description>External Interrupt 29 Input Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT28S" -->
            <field>
              <name>EINT28S</name>
              <description>External Interrupt 28 Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT27S" -->
            <field>
              <name>EINT27S</name>
              <description>External Interrupt 27 Input Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT26S" -->
            <field>
              <name>EINT26S</name>
              <description>External Interrupt 26 Input Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT25S" -->
            <field>
              <name>EINT25S</name>
              <description>External Interrupt 25 Input Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT24S" -->
            <field>
              <name>EINT24S</name>
              <description>External Interrupt 24 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT23S" -->
            <field>
              <name>EINT23S</name>
              <description>External Interrupt 23 Input Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT22S" -->
            <field>
              <name>EINT22S</name>
              <description>External Interrupt 22 Input Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT21S" -->
            <field>
              <name>EINT21S</name>
              <description>External Interrupt 21 Input Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT20S" -->
            <field>
              <name>EINT20S</name>
              <description>External Interrupt 20 Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT19S" -->
            <field>
              <name>EINT19S</name>
              <description>External Interrupt 19 Input Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT18S" -->
            <field>
              <name>EINT18S</name>
              <description>External Interrupt 18 Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT17S" -->
            <field>
              <name>EINT17S</name>
              <description>External Interrupt 17 Input Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT16S" -->
            <field>
              <name>EINT16S</name>
              <description>External Interrupt 16 Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR16" -->
        <register>
          <name>EPFR16</name>
          <description>Extended Pin Function Setting Register 16</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SFMPBC" -->
            <field>
              <name>SFMPBC</name>
              <description>MFS ch.B I2C FastMode+ Select bit</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SFMPAC" -->
            <field>
              <name>SFMPAC</name>
              <description>MFS ch.A I2C FastMode+ Select bit</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK11B" -->
            <field>
              <name>SCK11B</name>
              <description>SCK11 Input/Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT11B" -->
            <field>
              <name>SOT11B</name>
              <description>SOT11 Input/Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN11S" -->
            <field>
              <name>SIN11S</name>
              <description>SIN11 Input Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK10B" -->
            <field>
              <name>SCK10B</name>
              <description>SCK10 Input/Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT10B" -->
            <field>
              <name>SOT10B</name>
              <description>SOT10 Input/Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN10S" -->
            <field>
              <name>SIN10S</name>
              <description>SIN10 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK9B" -->
            <field>
              <name>SCK9B</name>
              <description>SCK9 Input/Output Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT9B" -->
            <field>
              <name>SOT9B</name>
              <description>SOT9 Input/Output Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN9S" -->
            <field>
              <name>SIN9S</name>
              <description>SIN9 Input Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK8B" -->
            <field>
              <name>SCK8B</name>
              <description>SCK8 Input/Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT8B" -->
            <field>
              <name>SOT8B</name>
              <description>SOT8 Input/Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN8S" -->
            <field>
              <name>SIN8S</name>
              <description>SIN8 Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS7B" -->
            <field>
              <name>SCS7B</name>
              <description>SCS7 Input/Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS6B" -->
            <field>
              <name>SCS6B</name>
              <description>SCS6 Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR17" -->
        <register>
          <name>EPFR17</name>
          <description>Extended Pin Function Setting Register 17</description>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK15B" -->
            <field>
              <name>SCK15B</name>
              <description>SCK15 Input/Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT15B" -->
            <field>
              <name>SOT15B</name>
              <description>SOT15 Input/Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN15S" -->
            <field>
              <name>SIN15S</name>
              <description>SIN15 Input Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK14B" -->
            <field>
              <name>SCK14B</name>
              <description>SCK14 Input/Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT14B" -->
            <field>
              <name>SOT14B</name>
              <description>SOT14 Input/Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN14S" -->
            <field>
              <name>SIN14S</name>
              <description>SIN14 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK13B" -->
            <field>
              <name>SCK13B</name>
              <description>SCK13 Input/Output Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT13B" -->
            <field>
              <name>SOT13B</name>
              <description>SOT13 Input/Output Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN13S" -->
            <field>
              <name>SIN13S</name>
              <description>SIN13 Input Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK12B" -->
            <field>
              <name>SCK12B</name>
              <description>SCK12 Input/Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT12B" -->
            <field>
              <name>SOT12B</name>
              <description>SOT12 Input/Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN12S" -->
            <field>
              <name>SIN12S</name>
              <description>SIN12 Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
