cmsis-svd/cmsis-svd/data/Infineon/s6e2ghxj.svd
        <!-- REGISTER "PDSRF" -->
        <register>
          <name>PDSRF</name>
          <description>Port Driver capability Select Register F</description>
          <addressOffset>0x77C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of PDSRF</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of PDSRF</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PDSRF</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of PDSRF</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDSRF</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDSRF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDSRF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDSRF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>